# BendPolylineInvalid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..BendPolylineInvalid Property
BuiltInFailures..::..FabricFailures Class See Also
---
The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BendPolylineInvalid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendPolylineInvalid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BendPolylineInvalid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace